package com.feather.hikvision.config;

/**
 * @author nothing
 * @date 2020-05-29 14:14
 */
public enum EventType {
    E_131329("131329", "视频丢失"),
    E_131330("131330", "视频遮挡"),
    E_131331("131331", "移动侦测"),
    E_131612("131612", "场景变更"),
    E_131613("131613", "虚焦"),
    E_589825("589825", "报警输入"),
    E_196355("196355", "可视域事件"),
    E_851969("851969", "GPS采集"),
    E_131588("131588", "区域入侵"),
    E_131585("131585", "越界侦测"),
    E_131586("131586", "进入区域"),
    E_131587("131587", "离开区域"),
    E_131590("131590", "徘徊侦测"),
    E_131593("131593", "人员聚集"),
    E_131592("131592", "快速移动"),
    E_131591("131591", "停车侦测"),
    E_131594("131594", "物品遗留"),
    E_131595("131595", "物品拿取"),
    E_131664("131664", "人数异常"),
    E_131665("131665", "间距异常"),
    E_131596("131596", "剧烈运动"),
    E_131603("131603", "离岗"),
    E_131605("131605", "倒地"),
    E_131597("131597", "攀高"),
    E_131610("131610", "重点人员起身"),
    E_131608("131608", "如厕超时"),
    E_131666("131666", "人员站立"),
    E_131667("131667", "静坐"),
    E_131609("131609", "防风场滞留"),
    E_131598("131598", "起身"),
    E_131599("131599", "人靠近ATM"),
    E_131600("131600", "操作超时"),
    E_131601("131601", "贴纸条"),
    E_131602("131602", "安装读卡器"),
    E_131604("131604", "尾随"),
    E_131606("131606", "声强突变"),
    E_131607("131607", "折线攀高"),
    E_131611("131611", "折线警戒面"),
    E_192518("192518", "温差报警"),
    E_192517("192517", "温度报警"),
    E_192516("192516", "船只检测"),
    E_192515("192515", "火点检测"),
    E_192514("192514", "烟火检测"),
    E_192513("192513", "烟雾检测"),
    E_889196545("889196545", "监控点离线"),

    E_198400("198400", "开门超时"),
    E_198657("198657", "门被外力开启"),
    E_200453("200453", "读卡器防拆报警"),
    E_200455("200455", "读卡器掉线报警"),
    E_199708("199708", "设备防拆报警"),
    E_199710("199710", "装置离线"),
    E_197121("197121", "密码错误"),
    E_198145("198145", "刷卡+密码不开门"),
    E_197137("197137", "刷卡+指纹+密码超时"),
    E_327681("327681", "防区报警"),
    E_327941("327941", "子系统消警");

    private String code;
    private String name;

    private EventType(String code, String name) {
        this.name = name;
        this.code = code;
    }


    public String getCode() {
        return code;
    }

    public void setCode(String code) {
        this.code = code;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public static String getName(String code) {
        EventType[] eventTypeEnums = values();
        for (EventType eventTypeEnum : eventTypeEnums) {
            if (eventTypeEnum.code.equals(code)) {
                return eventTypeEnum.name;
            }
        }
        return null;
    }

    public static void main(String[] args) {
        String name = EventType.getName("197137");
        System.out.println(name);
    }
}
